/****************************************************
初版时间: 2014-01-28
功能：
1.飞机硬件初始化
2.参数初始化
3.定时器开
4.等待中断到来
*****************************************************/

#include "config_com.h"   //包含所有的驱动头文件

/************************************************************************/
/* 功能  ：主函数入口                                                   */
/*         初始化系统参数                                               */
/*         初始化各个硬件                                               */
/*         开定时器4等待数据中断到来                                    */
/*         开定时器3串口广播实时姿态以及相关信息                        */
/* 参数  ：无                                                           */
/* 返回值：无                                                           */
/************************************************************************/
int main(void)
{
  //int i;
  //SystemClock_HSE(9);           //系统时钟初始化，时钟源外部晶振HSE
  //SystemClock_HSI(4);           //系统时钟初始化，时钟源内部HSI  
  uart1_init(115200); 	        //串口1初始化
  NVIC_INIT();	                //中断初始化
  stmflash_unlock();            //内部flash解锁
  led_init();		            //LED初始化 
  delay_init();                 //延时初始化
  bt_power_init();              //蓝牙电源初始化完成，默认关闭
  motor_pwm_init();	            //马达初始化
  battery_check_init();         //电池电压监测初始化
  i2c_init();                   //IIC初始化
  MPU6050_DMP_Initialize();     //初始化DMP引擎
  //HMC5883L_SetUp();           //初始化磁力计HMC5883L
  PID_INIT();                   //PID参数初始化 
  ParameterRead();              //Flash参数读取
  NRF24L01_INIT();              //NRF24L01初始化
  SetRX_Mode();                 //设无线模块为接收模式
  PowerOn();                    //开机等待
  BT_ON();                      //蓝牙开
  //TIM3_Init(SysClock,10);	      //定时器3初始化，调试串口输出
  //TIM4_Init(SysClock,50);	      //定时器4初始化，定时采样传感器数据，更新PID输出

  //Tout = ((9+1)*(7199+1))/72 = 1 000us = 1ms
  TIM3_Int_Init(99 ,7199);//定时器3初始化，调试串口输出
  //Tout = ((49+1)*(7199+1))/72 = 5 000us = 5ms
  TIM4_Int_Init(499 ,7199);//定时器4初始化，定时采样传感器数据，更新PID输出
  while (1);                    //等待数据更新中断到来
}



