#ifndef __BT_H__
#define __BT_H__

#include "stm32f10x.h"
#include "usart.h"

/************************************************************************/
/*                                                                      */
/************************************************************************/
//#define bt_on()      {GPIO_SetBits(GPIOB, GPIO_Pin_2);  printf("***蓝牙电源开启***\n");}
//#define bt_off()     {GPIO_ResetBits(GPIOB, GPIO_Pin_2);printf("***蓝牙电源关闭***\n");}

#define BT_ON()    do \
{ \
	GPIO_SetBits(GPIOB, GPIO_Pin_2); \
	printf("***蓝牙电源开启***\n"); \
} while (0)


#define BT_OFF()    do \
{ \
	GPIO_ResetBits(GPIOB, GPIO_Pin_2); \
	printf("***蓝牙电源关闭***\n"); \
} while (0)

/************************************************************************/
/*                                                                      */
/************************************************************************/
	void bt_power_init(void);   //蓝牙透传电源初始化

/************************************************************************/
/*                                                                      */
/************************************************************************/

#endif //__BT_H__

